## Plan Result (Managed_Identity_ithc - Managed_Identity)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.genesis_rg_contributor[0]
* Update
  * azurerm_user_assigned_identity.sops-mi
  * azurerm_user_assigned_identity.wi-admin-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.genesis_rg_contributor[0] will be created
  + resource "azurerm_role_assignment" "genesis_rg_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fcf1fd52-1e62-4827-b8f7-7088bc9dd488"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/genesis-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.sops-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "sops-mi" {
        id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ithc-mi"
        name                = "aks-ithc-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.wi-admin-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "wi-admin-mi" {
        id                  = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/managed-identities-ithc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/admin-ithc-mi"
        name                = "admin-ithc-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label Managed_Identity_ithc - Managed_Identity/add-or-update: POST https://api.github.com/repos/hmcts/aks-cft-deploy/issues/695/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":695,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity_ithc - Managed_Identity","Vars":{}} -->